pkg/wsman/wsmantesting/responses/cim/chip/get.xml

<?xml version="1.0" encoding="UTF-8"?>
<a:Envelope xmlns:a="http://www.w3.org/2003/05/soap-envelope"
    xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust"
    xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd"
    xmlns:g="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_Chip"
    xmlns:h="http://schemas.dmtf.org/wbem/wscim/1/common"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <a:Header>
        <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
        <b:RelatesTo>0</b:RelatesTo>
        <b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</b:Action>
        <b:MessageID>uuid:00000000-8086-8086-8086-000000000E7C</b:MessageID>
        <c:ResourceURI>http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_Chip</c:ResourceURI>
    </a:Header>
    <a:Body>
        <g:CIM_Chip>
            <g:CanBeFRUed>true</g:CanBeFRUed>
            <g:CreationClassName>CIM_Chip</g:CreationClassName>
            <g:ElementName>Managed System Processor Chip</g:ElementName>
            <g:Manufacturer>Intel(R) Corporation</g:Manufacturer>
            <g:OperationalStatus>0</g:OperationalStatus>
            <g:Tag>CPU 0</g:Tag>
            <g:Version>Intel(R) Core(TM) i7-9850H CPU @ 2.60GHz</g:Version>
        </g:CIM_Chip>
    </a:Body>
</a:Envelope>